app/views/songs/show.html.erb

      <tr style="font-size:12px;">
        <td style="padding:4px;"> <a href="/users/<%=list.user_id%>"> <%= list.user.first_name %> <%= list.user.last_name %></a></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]