app/controllers/songs_controller.rb

  def index
    # scope: newest_first, order(created_at: :desc)

    @songs = Song.all.reverse
---
SELECT "songs".* FROM "songs"

  def show
    # @song = Song.where(id: params[:id])
    # @playlist = Userplaylist.where(song_id: params[:id])
    @user = User.find(session[:user_id])
    @song = Song.find(params[:id])
    @playlist = Userplaylist.where(song: @song)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 8]]
SELECT "userplaylists".* FROM "userplaylists" WHERE "userplaylists"."song_id" = ?  [["song_id", 1]]

  def create
    @user = User.find(session[:user_id])
    @songs = Song.create(title: params[:title], artist: params[:artist], count:0)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "songs" ("title", "artist", "count", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Back in Black"], ["artist", "AC/DC"], ["count", 0], ["created_at", "2018-03-04 23:28:30.802352"], ["updated_at", "2018-03-04 23:28:30.802352"]]