app/controllers/userplaylists_controller.rb

  def create
    # ORIGINAL CODE FOR CREATING PLAYLIST
    # @user = User.find(session[:user_id])
    # @song = Song.find(params[:song_id])
    # @songs = Userplaylist.create(song: @song, user: @user, add:+1)
    #
    # @song = Song.find(params[:id])
    # puts'>>>>>>>>>>--------------***************'
    # @user = User.find(session[:user_id])
    # puts'>>>>>>>>>>--------------***************'
    # @song.update_attribute(:count, @song.count += 1)
    # puts'>>>>>>>>>>--------------***************'
    #
    # redirect_to :back


# MODIFIED FOR CREATING PLAYLIST AND UPDATING COUNT FO SONGS 7.24.17
    song = Song.find(params[:id])
    user = User.find(session[:user_id])
    user_added = Userplaylist.find_by(user: user,song:params[:id])

    puts "=======================)))))))))"
    puts song
    puts user
    puts"++++++++++++++++++++++++*********"
    if(user_added)
      user_added.increment!(:add)
      Song.find(params[:id]).increment!(:count)
      puts"checking for user_added ................."
    else
      Userplaylist.create(user: user, song: song, add: 1)
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "userplaylists".* FROM "userplaylists" WHERE "userplaylists"."user_id" = 2 AND "userplaylists"."song_id" = 18 LIMIT 1
UPDATE "songs" SET "count" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["count", 3], ["updated_at", "2017-06-03 21:20:55.867703"], ["id", 3]]
UPDATE "userplaylists" SET "add" = ?, "updated_at" = ? WHERE "userplaylists"."id" = ?  [["add", 2], ["updated_at", "2017-07-24 18:52:38.529191"], ["id", 47]]
INSERT INTO "userplaylists" ("user_id", "song_id", "add", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["song_id", 1], ["add", 1], ["created_at", "2018-03-04 23:30:09.842164"], ["updated_at", "2018-03-04 23:30:09.842164"]]

  def update
    @song = Song.find(params[:id])
    puts'>>>>>>>>>>--------------***************'
    @user = User.find(session[:user_id])
    puts'>>>>>>>>>>--------------***************'
    @song.update_attribute(:count, @song.count += 1)
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 18]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "songs" SET "count" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["count", 2], ["updated_at", "2017-06-03 20:57:40.866044"], ["id", 4]]