app/controllers/users_controller.rb

  def show
    @user = User.find_by(id: params[:id])
    puts  '>>>>>>>>>>-----------------!!!!!!!!!!!!'
    @playlist = Userplaylist.all
    puts  '>>>>>>>>>>-----------------@@@@@@@@@@@@s'
    puts @playlist
    # @playlist.all.where("user_id=?", @user.id)
    @userslist = []
    puts  '>>>>>>>>>>-----------------#############'
    puts @user.id
    puts  '>>>>>>>>>>-----------------#############'
    puts @user
    @playlist.each do |item|
      puts  '>>>>>>>>>>-----------------^^^^^^^^^^^^'
      if item.user.id == @user.id
        unless @userslist.include?(item.song)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "userplaylists".* FROM "userplaylists" WHERE (user_id=SELECT "users".* FROM "users" WHERE "users"."id" = 1)
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]

  def login
    @users = User.find_by_email(params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "marla@email.com"]]

  def create
    @users = User.create(
    first_name: params[:first_name],
    last_name: params[:last_name],
    email: params[:email],
    password: params[:password]
    )
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"